var breeds = [

{         "id": 6466,         "name": "Poodle",
         "origin": "descended from the Barbet and the Hungarian Water Hound",
         "group": "Non-sporting ",
         "weight": "45 and 70 pounds",
         "temperament": "Energetic",
         "lifespan": "10 -15",
         "description": "They are outgoing friendly dogs who love to run and romp Poodles make excellent watchdogs they are alert and curious and will sound the alarm that a person or animal is approaching. They often dont do well in homes with lots of children where there may be a great deal of yelling and tension. While they do not shed the hair grows constantly so loose hair and tangles need to be prevented and removed so that mats do not form. Bathing and trimming is required every three weeks. Standard Poodles are terrific outdoor dogs.",
         "picfilename": "poodle.jpg",
         "hashealthIssues": true,         "healthIssues": {             "issue": "epilepsy,hip dysplasia, Legg-Calve-Perthes disease, patent ductus arteriosis, dilated cardiomyopathy, patellar luxation, progressive retinal atrophy, sebaceous adenitis, a number of skin problems, renal disorders, von Willebrand disease."         },         "hasTrainingTip": true,         "trainingTip": {             "tip": "They need to run daily. Poodles that don't get enough exercise can be anxious or destructive"         },         "height": "15 inches or taller "     },

{         "id": 4044,         "name": "Shih Tzu ",
         "origin": "origin of the Shih Tzu dates back many centuries to ancient China and Tibet. Name means Lion",
         "group": "Toy",
         "weight": "9 to 16 pounds",
         "temperament": "Friendly",
         "lifespan": "11-15",
         "description": "Make excellent watchdogs. They are alert vigilant and will reliably bark. Makes them ideal for apartments and condominiums. They can live in any sized home and excellent for families single people and make ideal companions for the elderly. Daily brushing and combing is a must to remove tangles and bathing is usually necessary once per week.",
         "picfilename": "shihtzu.JPG",
         "hashealthIssues": true,         "healthIssues": {             "issue": "Dental disorders and diseases affecting the dogs mouth: Cleft Palate. Eye Problems Issues relating to the dog's vision an or ability to see. Hypothyroidism a clinical syndrome caused by inadequate production and release of the thyroid hormones triiodothyronine T3 and thyroxine T4. Invertebral Disk Disease Neurological deficits caused by degeneration and displacement of the material inside an intervertebral disk. Patellar Luxation Patellar luxation, commonly known as a 'slipped knee cap' occurs when the patella is displaced from the joint. Renal Dysplasia. Respiratory Problems Lung and airway disorders affect the dog's respiratory system: Von Willebrand Disease-the most common hereditary blood-clotting disorder in domestic dogs."         },         "hasTrainingTip": true,         "trainingTip": {             "tip": "Are lap dogs and are by no means active outdoorsy dogs. Simple walk around the block and some romping time in the yard or at the park are enough to meet their daily exercise requirements"         },         "height": "9 to 10"     },
		 
		 {         "id": 8484,         "name": "Dachshund",
         "origin": "originated in Germany in the early 1600s",
         "group": "Hound Dog",
         "weight": "Standard Dachshund weighs between 16 and 32 pounds and Miniature Dachshunds weigh 11 pounds and under",
         "temperament": "Neurotic",
         "lifespan": "12-15",
         "description": "They tend to like to take on other dogs by yapping incessantly, but never following up on their mouthy threats. They are attention loving clowns who will steal the show whenever they can. Smooth Dachshunds do not require much grooming at all. Wirehaired Dachshunds on the other hand require regular brushing in order to keep their coats free from mats and debris and require more frequent bathing than their smooth-coated. Longhaired Dachshunds require regular bathing and daily brushing is required. Excellent companions for single people or empty nesters who have a lot to time to devote solely to their dog. Barking is the most common 'issue' with Dachshunds.",
         "picfilename": "dachshund.jpg",
         "hashealthIssues": true,         "healthIssues": {             "issue": "Sick sinus syndrome, patent ductus arteriosus, pattern baldness, cutaneous asthenia, immune-mediated thrombocytopenia, lipomas, liposarcoma, congenital deafness, intervertebral disc disease, atlantoaxial subluxation , and a number of ocular disorders or conditions."         },         "hasTrainingTip": true,         "trainingTip": {             "tip": "Dachshunds don't need a lot of vigorous activity to remain healthy and happy though they should be walked daily and allowed to get out and run once in a while. They must think the activity or behavior was their own idea or they will become completely disinterested."         },         "height": "are 8 to 9 inches at the shoulder and the Miniature Dachshunds stand approximately six inches at the shoulder"     },

		 {         "id": 7677,         "name": "Dalmatians",
         "origin": "Dalmatians first appeared in Europe, Asia and Africa",
         "group": "Non sporting",
         "weight": ": Male Dalmatians typically weigh between 55 and 70 pounds, while females average 40 to 55.",
         "temperament": "Hyper-Energetic",
         "lifespan": "11-13",
         "description": "Because they love people so much  separation anxiety can develop which also leads to destructive behavior. Dalmatians, despite their white coloring are incredibly clean dogs with dirt repellent coats. Sheds heavily year roundhowever and daily brushing to remove loose hair is a must for those who prefer a very clean home.",
         "picfilename": "dalmatian.jpg",
         "hashealthIssues": true,         "healthIssues": {             "issue": "Pododermatitis, Solar Keratosis, Deafness (Defined as the lack or loss complete or partial of the sense of hearing), Entropion (inversion or the turning inward of all or part of the edge of an eyelid),Dermoids, Distichiasis, Chronic Superficial Keratitis, Epilepsy (a group of clinical signs that result from over stimulation of the brain), Hip Dysplasia (abnormal development and or degeneration of the (hip) joint, Hypothyroidism (inadequate production and release of the thyroid hormones triiodothyronine T3 and thyroxine T4), Renal Dysplasia, Laryngeal Paralysis."         },         "hasTrainingTip": true,         "trainingTip": {             "tip": "They need to be exercised often. Toddlers should always be supervised around this rowdy dog. Small children can accidentally get hurt playing with a rowdy Dalmatians. Highly trainable dogs."         },         "height": "19-23"     },

{         "id": 9291,         "name": "Boxer ",
         "origin": "Boxers are originally a German breed and are cousins to almost all types of Bulldogs",
         "group": "Working ",
         "weight": ": 60 pounds for females and 70 pounds for males",
         "temperament": "Hyper-Energetic",
         "lifespan": "11-14",
         "description": "Are highly energetic and as they grow into adulthood they never lose the desire to romp and play like a puppy. Protective of their family Boxers are alert and reliable watchdogs sounding the alarm that strangers are approaching. They tend to get along well with family pets they can be aggressive toward other dogs especially dogs of the same sex. Short coat is relatively no fuss. Weekly brushing will keep their year-round shedding under control. Occasional wipes with a chamois cloth will keep the coat shiny. Only need to be bathed as needed, which usually means once every three or four months.",
         "picfilename": "boxer.PNG",
         "hashealthIssues": true,         "healthIssues": {             "issue": "allergies, bloat, Boxer cardiomyopathy, sick sinus syndrome, pododermatitis (especially on the front feet), canine follicular dysplasia, brachycephalic syndrome, ear infections, epilepsy, hip dysplasia, hypothyroidism, insulinoma, pyloric stenosis, histiocytic colitis, congenital elbow luxation, melanoma, cutaneous histiocytoma, sensory neuropathy of Boxers, entropion, cherry eye, corneal ulceration, cryptorchidism, sarcomas, subaortic stenosis, Adverse drug reactions to even small doses of Acepromazine and other phenothiazines."         },         "hasTrainingTip": true,         "trainingTip": {             "tip": "Require a lot of vigorous exercise. Long daily walks and plenty of time to run are crucial. Are eternal kids and take direction about as well as any adolescent child. Training should be consistent and leadership should be shown with confidence."         },         "height": "between 21 and 23 inches at the shoulder"     },

{         "id": 8626,         "name": "Beagle",
         "origin": "British Isles",
         "group": "Hound Dogs",
         "weight": "18 to 30 pounds",
         "temperament": "Friendly",
         "lifespan": "12-14",
         "description": "Though technically hounds, the origin of the Beagle is described in an American Kennel Club publication as 'being lost in the mists of ancient days and no research it seems, can ever bring its true history to light.' Beagles are smart affectionate curious friendly and playful. They are ideal family pets because of their size groomability and easy going nature with children. Separation anxiety barking and destructiveness are common behavioral problems in beagles. Beagles shed year round. Weekly brushing with a higher frequency in Springtime can keep hair from making a mess. Couch potatoes will want to steer clear of beagles this breed loves constant activity and the outdoors.",
         "picfilename": "beagle.PNG",
         "hashealthIssues": true,         "healthIssues": {             "issue": "Hypothyroidism, hip dysplaxia, Beagle Pain Syndrome, Chinese Beagle Syndrome, Corneal Dystrophy, Glaucoma Serious disorder characterized by fluid build-up inside of the eye, Pulmonic Stenosis, Pituitary Dependant Hyperadrenocorticism, Hepatitis, Anemia Reduction in the normal number of red blood cells (RBCs), Lymphosarcoma, Deafness, Invertebral Disk Disease Neurological (deficits caused by degeneration and displacement of the material inside an intervertebral disk), Narcolepsy (Disorder of the neurological mechanisms that control sleep – especially the state of deep sleep), Cherry Eye (thiird eyelid falls down or slips out of place), Cataracts. Dogs of either gender can develop cataracts. Hypochondroplasia (short bowed legs accepted as breed standard), XX Sex Reversal, Ear Infections."         },         "hasTrainingTip": true,         "trainingTip": {             "tip": "Despite their compact size Beagles require a lot of exercise. Breeders recommend several long walks a day plus time for running. Beagles have been labeled stubborn dogs and have a reputation for being difficult to train."         },         "height": "13-15 inches at the shoulder."     },

{         "id": 9030,         "name": "Golden Retriever ",
         "origin": "The Golden Retriever descends from dogs bred in the 1800s in Britain",
         "group": "Sporting Dogs",
         "weight": "Males should weight between 65 and 75 pounds females between 55 and 65 pounds ",
         "temperament": "Friendly",
         "lifespan": "10-12",
         "description": "They are obedient playful intelligent well mannered great with kids and kindly to strangers Goldens are popular and this has led to indiscriminate breeding practices which means puppies with unstable temperaments. If left alone too long, especially without proper exercise, Golden Retrievers can develop Separation Anxiety which usually means destructive chewing, even when provided plenty of their own chew toys and bones. Daily brushing is required to prevent tangles. Monthly bathing is a must because they are prone to emit a doggie odor. ",
         "picfilename": "golden.jpg",
         "hashealthIssues": true,         "healthIssues": {             "issue": "Cancer (Various forms) Defined as any malignant cellular tumor Cataracts Refers to any opacity of the lens of the eye Dogs of either gender can develop cataracts Elbow Dysplasia Leads to malformation and degeneration of the elbow joint with accompanying front limb lameness Hip Dysplasia Involves abnormal development andor degeneration of the coxofemoral hip joint Muscular dystrophy Duchennes X-linked muscular dystrophy cardiomyopathy Hypothyroidism: a clinical syndrome caused by inadequate production and release of the thyroid hormones triiodothyronine T3 and thyroxine T4 Insulinoma Myasthenia gravis Hock osteochondrosis Mucocutaneous Hypopigmentation Pericardial Effusion Progressive Retinal Atrophy Refers to a group of degenerative eye disorders that eventually lead to permanent blindness in both eyes Obesity Obesity is defined as an increase of over 20% above the optimum body weight Skin Disorders Conditions that affect the dog's fur and skin Causes are often related to allergies bacteria fungus or parasites Subaortic Stenosis "         },         "hasTrainingTip": true,         "trainingTip": {             "tip": "Golden Retrievers need a lot of exercise Golden Retrievers are a breeze to train "         },         "height": ": Males should stand from 23 to 24 inches Females should stand 21.5 to 22.5 inches"     },

{         "id": 7819,         "name": "Jack Russell Terrier ",
         "origin": "The Jack Russell Terrier was developed in Devonshire, England, in the early 1800s",
         "group": "Terrier Dogs",
         "weight": "13 to 17 pounds",
         "temperament": "Hyper-Energetic",
         "lifespan": "12-14",
         "description": "They are spirited terriers, fearless and sassy with minds of their own and aren't above causing mischief to get a laugh. Jack Russell's make fine family dogs Jack Russell's are NOT apartment dogs. Classic terrier traits including excessive barking, willfulness, rudeness to strangers, dog aggression, possessiveness and jealousy ",
         "picfilename": "jackrussell.PNG",
         "hashealthIssues": true,         "healthIssues": {             "issue": "cataracts cerebellar ataxia  congenital deafness Legg-Calve-Perthes disease lens luxation myasthenia gravis patellar luxation von Willebrand disease "         },         "hasTrainingTip": true,         "trainingTip": {             "tip": "Are highly trainable and are famous for their high-jumping antics Discipline and harsh tones will cause this dog to become defensive which may lead to snapping or biting "         },         "height": "male Jack Russell Terriers is 14 inches at the shoulder and for females, 13 inches"     },

{         "id": 9837,         "name": "German Shepherd ",
         "origin": "The German Shepherd was developed in Germany in the late 1800s",
         "group": "Herding Dogs",
         "weight" : "Males range in weight from 75 to 90 pounds and females generally weigh between 50 and 70 pounds",
         "temperament": "Protective",
         "lifespan": "10-13",
         "description": "German Shepherds have a rather distinct personality marked by a direct and fearless expression obvious self-confidence and reluctance to develop indiscriminate friendships. They tend to be indifferent to strangers and can be aloof, however, once they befriend you their devotion is lifelong. With a Dog Bite Ranking at No.3, they can be bold but should not be unnecessarily aggressive. While highly trainable, they should be socialized and trained young in life. They are heavy shredders, so brush the dog several times per week. German Shepherds are clean dogs and baths may only be needed once every few months. They make outstanding, loving family companions.",
         "picfilename": "germansheperd.jpg",
         "hashealthIssues": true,         "healthIssues": {             "issue": "allergies aortic stenosis bloat  cataracts  cherry eye  Cushing's disease degenerative myelopathy discospondylitis hip dysplasia epilepsy exocrine pancreatic insufficiency footpad disorders folliculitis/furunculosis/cellulitis glycogen storage disease hemangiosarcoma  hypothyroidism immune-mediated thrombocytopenia mitral dysplasia myasthenia gravis nasal cavity tumors panosteitis persistent right aortic arch pituitary dwarfism tricuspid dysplasia "         },         "hasTrainingTip": true,         "trainingTip": {             "tip": "Are extremely intelligent They also can thrive with regular games of fetch with a stick, ball or Frisbee Regular walks will suit most GSDs just fine; many also enjoy off-leash romps in secure dog parks "         },         "height": "male German Shepherds is 24 to 26 inches at the shoulder, for females, 22 to 24 inches"     },

		 {         "id": 5255,         "name": "Labrador Retriever ",
         "origin": "The Labrador's ancestors date back to 17th century Canada",
         "group": "Sporting Dogs",
         "weight": "Males should weigh between 65 and 80 pounds and females should weigh 55 to 70",
         "temperament": "Friendly",
         "lifespan": "10-14",
         "description": "Loyal loveable, happy and friendly, Labradors are truly man's best friend and are at their happiest when engaged in family activities. They are extremely patient with children of all ages, and love exercise and enjoy spending time with people and other dogs. Chewing and mouthing is a common problem among Labradors, they are famous for being clumsy. A young Lab is often described as a bull in a China shop. Labradors shed heavily throughout the year. Baths are required quite often but they enjoy water and are not a problem to bathe at home.",
         "picfilename": "labrador.PNG",
         "hashealthIssues": true,         "healthIssues": {             "issue": "Elbow Dysplasia Leads to malformation and degeneration of the elbow joint with accompanying front limb lameness Hip Dysplasia Involves abnormal development and or degeneration of the coxofemoral  hip joint Allergies Overreaction by the immune system to an allergen, which is any substance that is capable of inducing a reaction in that particular animal Patellar Luxation Patellar luxation commonly known as a slipped knee cap occurs when the patella is displaced from the joint Waterline Disease of Black Labrador Retrievers (severe pruritis, seborrhea and alopecia of the legs and belly Diabetes Mellitus Malfunction destruction or even absence of certain cells which are responsible for producing and secreting insulin Melanoma Fairly common locally invasive and frequently malignant cancer in domestic dogs Entropion The inversion or the turning inward of all or part of the edge of an eyelid Ectropion Physical condition in which the eyelid rolls outward, exposing the sensitive inner eyelid to harsh environmental conditions Glaucoma Serious disorder characterized by fluid build-up inside of the eye Cataracts The term cataract refers to any opacity of the lens of the eye Dogs of either gender can develop cataracts Progressive Retinal Atrophy Refers to a group of degenerative eye disorders that eventually lead to permanent blindness in both eyes Obesity Obesity is defined as an increase of over 20% above the optimum body weight Lymphooma Cancer (neoplasia) that affects lymph nodes and other organs containing lymphoid tissue Cranial Cruciateligament Rupture (CCL) Part of the stifle joint and acts to limit internal rotation and forward movement of the leg Insulinoma Cctopic Ureters Congenital Portosystemic Shunt Osteochondrosis shoulder hock Generalized and Central Retinal Dysplasia "         },         "hasTrainingTip": true,         "trainingTip": {             "tip": "Labradors are a breeze to train Training should start early as Labs grow quickly and if they don't have basic commands mastered early on can be too large to reign in Once basic obedience is mastered, Labs can graduate on to advanced training or agility activities "         },         "height": "Male Labs should stand from 22.5 to 24.5 inches and females should stand 21.5 to 23.5"     },

		 {         "id": 5397,         "name": "Cavalier King Charles Spaniel ",
         "origin": "This dog breed acquired its name because it was a great favorite of King Charles I of Britain in the 1600s",
         "group": "Toy",
         "weight": "13 and 18 pounds",
         "temperament": "Gentle",
         "lifespan": "10-14",
         "description": "Energetic dog with hunting roots, who loves the outdoors just as much as they love curling up in a lap for a belly rub. An ideal choice for the first-time dog owner. They make great companions for active retired seniors who are willing to walk them daily and have a yard for running. They cannot be trusted in an open yard or off a leash. The wavy, silky coat is fairly easy to maintain only need to be bathed as necessary. They don't require trimming. Can happily live an apartment or condominium, as long as a commitment is made to their daily activity requirements. Anxiety is common with this breed.",
         "picfilename": "cavalierspaniel.PNG",
         "hashealthIssues": true,         "healthIssues": {             "issue": "Chiari-like malformation hip dysplasia endocardiosis  patent ductus arteriosus mitral valve disease patellar luxation  entropion distichiasis keratoconjunctivitis sicca retinal dysplasia brachycephalic upper airway syndrome syringomyelia "         },         "hasTrainingTip": true,         "trainingTip": {             "tip": "Cavalier King Charles Spaniels are naturally well behaved, and training them is a breeze Enjoy tracking and chasing, and have energy to spare when they are involved in such tasks "         },         "height": "12 to 13 inches"     },
		 
		 {         "id": 7939,         "name": "American Bulldog ",
         "origin": "the American Bulldog is probably descended from an ancient Mastiff line, and it is the closest relative to the Old English Bulldog",
         "group": "Non-Sporting Dogs",
         "weight": "Male American Bulldogs should weight between 75 and 125 pounds females weigh anywhere from 60 to 100 pounds",
         "temperament": "Protective",
         "lifespan": "8-14",
         "description": "Active and playful the American Bulldog loves people and craves constant attention Are notoriously dog aggressive Should be kept away from cats Can work or play all day long and will happily curl up at your feet for a nice belly rub at the end of the day Houses with fenced in yards or farms with wide open spaces are the best environment As they grow up same sex dogs will mostly likely still create problems Relatively low maintenance on the grooming front Regular brushing can keep their moderate year round shedding from becoming unruly The wrinkles of the face should be wiped and dried regularly in order to prevent bacteria Weekly or even daily tooth brushing  ",
         "picfilename": "bulldog.jpg",
         "hashealthIssues": true,         "healthIssues": {             "issue": "bone cancer congenital deafness elbow and hip dysplasia entropion thyroid problems "         },         "hasTrainingTip": true,         "trainingTip": {             "tip": "Needs a home where outdoor activities are the norm They should be provided a variety of activities including walking jogging chasing balls agility farm work pulling weights need at least an hour or two of vigorous exercise per day to meet their daily activity requirement Should never be left off leash in an open area "         },         "height": "Male American Bulldogs stand between 22 and 28 inches; Females stand between 20 and 25 inches"     }

	{
    "id": 5136,
    "name": "Irish Wolfhound",
    "origin": "British Isles",
    "group": "Hound",
    "weight": "120-180 lbs",
    "temperament": "Gentle",
    "lifespan": "5-10",
    "description": "Known as the tallest of the canines (yes, taller than a Great Dane!) Irish Wolfhounds are ative to the ancient Celtic lands of Ireland and Scotland. They are sighthounds, used since antiquity to hunt wolves and even go to battle. A very ancient breed, this amazing dog was noted in history by the Ancient Romans in Britain, notably Julius Caesar, who in his 'Gallic Wars' wrote of the dog's ferocious nature in battle. However, the Irish Wolfhound is generally quiet by nature but also very loyal to his family. An old Celtic proverb accurately describes this breed as 'Gentle when stroked, fierce when provoked.'",
    "picfilename": "irishwolf.PNG",
    "hasHealthIssue": true,
    "healthIssue": {
        "issue": "Likeotherlargedogs, they tend to develop bone cancer. Also, do not feed supplements as they grow to be very large dogs even without them!"
    },
    "hasTrainingTip": true,
    "trainingTip": {
        "tip": "They are instintively prone to 'chasing' thus a good leash will often come in handy. However, they are not hardtotrain."
    },
    "height": "30-46 in"
}

];